example/app/controllers/account_activation_controller.rb

    def edit
      user = User.find_by(email: params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "test@gmail.com"], ["LIMIT", 1]]