example/app/controllers/password_resets_controller.rb

  def update
    @user = User.find_by(email: params[:email])
    if params[:user][:password].empty?
      @user.errors.add(:password, "can't be empty")
      render "edit"
    elsif @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "test@gmail.com"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE (QL-vzB1zR4fC8lOUaN95AA) LIMIT ?  [["LIMIT", 1]]
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$UiCkp9bvRudibGFx3hryZug4Ijo7TK6IA.cSTiI83AcGr51N30k46"], ["updated_at", "2019-04-18 09:46:51.102258"], ["id", 130]]

  def create
    @user = User.find_by(email: params[:password_reset][:email].downcase)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "test@gmail.com"], ["LIMIT", 1]]