example/app/controllers/users_controller.rb

  def show
    @user = User.find_by(params[:id])
---
SELECT  "users".* FROM "users" WHERE (17admin=1) LIMIT ?  [["LIMIT", 1]]

  def edit
    @user = User.find_by(params[:id])
---
SELECT  "users".* FROM "users" WHERE (1) LIMIT ?  [["LIMIT", 1]]

  def create
    @user = User.new(user_params)
      if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest", "activation_digest") VALUES (?, ?, ?, ?, ?, ?)

  def update
    @user = User.find_by(params[:id])
    if @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE (1) LIMIT ?  [["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Chien"], ["password_digest", "$2a$10$.yI/tXgVlMNC0NssgD37QOi4zsBBfd3KrC2zChOrx3B2t9HV5q6r."], ["updated_at", "2019-04-16 09:00:17.366464"], ["id", 1]]